trade_exp/src/Documents/ПроверкаЦенников/ПроверкаЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fd17951c-1da2-49db-9c7e-f3150fc241fe">
  <name>ПроверкаЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="4a70e6fe-639f-44de-b3fd-237230052dc1">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5034a4d7-93d7-48ba-a44d-fdf429bc2eac">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7b9df7f-e2d1-4043-b06e-85fd4416f45a">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c849c33d-d44b-4398-9231-c9df953c93e2">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f9936d4d-9ec9-462a-8a56-f4dc8a27e883">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="59518efd-1ffc-47bb-919d-987145052d36">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33f586b2-0658-4db5-a72d-9f3fb3f64b70">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d65bbef-e89d-4630-ad15-da4215e03885">
    <name>ОтборПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c0981d1-37a3-4097-943b-888d82353308">
    <name>ДополнительноеСведениеКолонки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6412a95-3905-47a5-b58c-42ddc3273893">
    <name>ВидПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6ed79a42-e86c-4a2e-bcdd-4741381451bd">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="85673eb7-8a97-4e43-8918-bc1fd724a199">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00cebe0f-6fe8-498f-9da3-00097fb7b1ff">
      <name>ЦенаТекущая</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="43b8f031-f17d-450b-8d5d-9331b98c3e40">
      <name>ЦенаНаЦеннике</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bee02909-0b00-49d6-8e3a-17bdc46db3f3">
      <name>ЕстьРасхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b14de1c9-ce62-446e-b7f4-1e380660b377">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="307a9612-2229-444e-9ab6-16cbcdd055e0">
      <name>НетЦенника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12fd7174-1d80-46c0-8a1c-1bef2134ec91">
      <name>ДополнительноеСведение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c7bc165d-b056-49f4-9989-2b83551a416e">
      <name>Проверено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ef115090-8fca-4521-9bd1-ecc07f568bec">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3a3a65ce-80a9-435f-9aa2-21d5add59229">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СобытияПечатиЦенников/СобытияПечатиЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="668763c1-e35b-4ca3-ad1c-1940b52c274d">
  <name>СобытияПечатиЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="c9a46962-1c19-47e5-abd4-25c3fec480b1">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="293e3525-c153-408f-9975-0df7c95578db">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="4251caaf-df2e-4560-9c7f-caffc4993d8e">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0bdeb93b-0076-40f3-aa2b-298f39166a8b">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b1bc5040-e92d-4477-b3d1-0c3225b64c41">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c40c1ae6-bee3-4e93-89ee-713a0426c5fc">
    <name>ДатаУстановкиЦены</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="d1e5a8e2-380d-41c3-8207-2ed539da4a08">
    <name>ШаблонЦенника</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2a5ca4ca-1c1b-412e-81c5-78f693f77795">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ПроверкаЦенников/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем МожноЗаписатьДокумент;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	УстановитьОграничениеДополнительногоСведения();
	ИнициализироватьКомпоновкуДанных(Ложь);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьОграничениеДополнительногоСведения()
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ(Свойство) КАК Свойство
					|ИЗ РегистрСведений.ДополнительныеСведения
					|ГДЕ ТипЗначения(Объект) = ТИП(Справочник.Номенклатура)";
    Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыВыбораДополнительногоСведения = Новый Массив();	
	
	ДоступныеДополнительныеСведения = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеДополнительныеСведения.Добавить(Выборка.Свойство);	
	КонецЦикла;
	
	Параметр = Новый ПараметрВыбора(
				"Отбор.Ссылка",
		    	    	Новый ФиксированныйМассив(ДоступныеДополнительныеСведения)
			);	
	
	ПараметрыВыбораДополнительногоСведения.Добавить(Параметр);
	
	Элементы.ДополнительноеСведениеКолонки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДополнительногоСведения);
	
	ЗаполнитьЗначенияПоДопСведению();   
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию)
	СхемаКомпоновкиДанных = Документы.ПроверкаЦенников.ПолучитьМакет("ОтборПроверкиПоСкладу");
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборПроверки.Инициализировать(ИсточникНастроек);
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекНастройки = ТекОбъект.ОтборПроверки.Получить();
	Если ТекНастройки = Неопределено
		Или ВсегдаИспользоватьНастройкиПоУмолчанию Тогда
		ОтборПроверки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборПроверки.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
	ОтборПроверки.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "Склад" , Объект.Склад);
	УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "ВидЦены" , Объект.ВидЦены);
	УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "Свойство" , Объект.ДополнительноеСведениеКолонки);
	//УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "Помещение", Объект.Помещение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	
	УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "ДатаОстатков", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
	УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "Склад" , Объект.Склад);
	УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "ВидЦены" , Объект.ВидЦены);
	УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "Свойство" , Объект.ДополнительноеСведениеКолонки);  
	УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "ЗначенияДопСведения" , ЗначенияДополнительногоСведения);
	Если ЗначенияДополнительногоСведения.Количество() = 0 Тогда 
		УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "ОтборПоДопСведению" , Ложь);
	Иначе
		УстановитьЗначениеПараметраНастроек(ОтборПроверки.Настройки, "ОтборПоДопСведению" , Истина);
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Документы.ПроверкаЦенников.ПолучитьМакет("ОтборПроверкиПоСкладу");
	
	//ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.ЗаполнениеПоОтборам.Запрос;
	//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	//	"&ТекстЗапросаКоэффициентУпаковки",
	//	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	//	"ТоварыВЯчейках.Упаковка", Неопределено));
	//СхемаКомпоновкиДанных.НаборыДанных.ЗаполнениеПоОтборам.Запрос = ТекстЗапроса;

	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(ОтборПроверки);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборПроверки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Объект.Товары.Загрузить(ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных));
	
	//ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	//ЗаполнитьПризнакРасхождение();
	//
	//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	МожноЗаписатьДокумент = Ложь;
	Если ВидПроверкиПоПереоценке() Тогда
		Элементы.ТоварыНетЦенника.Заголовок = "Нет актуального ценника";
	Иначе
		Элементы.ТоварыНетЦенника.Заголовок = "Нет ценника";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	Объект.Подразделение= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "Подразделение");
	Объект.ВидЦены= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Подразделение, "ЦенаПоКарте");
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Объект.ВидЦены= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Подразделение, "ЦенаПоКарте");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ДанныеШтрихкодов= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			Если ДанныеШтрихкодов.Количество() > 0 Тогда
			Штрихкод= ДанныеШтрихкодов[0].Штрихкод;
			
			ТекущаяЦена= 0;
			НомерСтроки= 0;
			ДобавитьСтроку(Штрихкод, ТекущаяЦена, НомерСтроки);
			
			Если ТекущаяЦена <> 0 Тогда
				Текст= "Текущая цена: "+ТекущаяЦена+Символы.ПС+"Правильная цена на ценнике?";
				ДопПараметры= Новый Структура("НомерСтроки", НомерСтроки);
				ОповещениеПослеЗакрытияВопроса = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, ДопПараметры);
				ПоказатьВопрос(ОповещениеПослеЗакрытияВопроса, Текст, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да);
			Иначе
				ПоказатьПредупреждение(, "Не удалось найти номенклатуру по штрихкоду!", 5);
				КонецЕсли;
		Иначе
			ПоказатьПредупреждение(, "Штрихкод неверного формата!", 5);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтроку(Штрихкод, ТекущаяЦена, НомерСтроки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаТекущая,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ШтрихкодыНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ШтрихкодыНоменклатуры.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("ВидЦены", Объект.ВидЦены);
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		НоваяСтрока= Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ТекущаяЦена= Выборка.ЦенаТекущая; 
		НомерСтроки= НоваяСтрока.НомерСтроки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДопПараметры) Экспорт
	ТекСтрока= Объект.Товары[ДопПараметры.НомерСтроки-1];
	Если Результат = КодВозвратаДиалога.Да ИЛИ Результат = КодВозвратаДиалога.Таймаут Тогда
		ТекСтрока.ЕстьРасхождения= Ложь;
	Иначе
		ТекСтрока.ЕстьРасхождения= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПечатьЦенников()
	ФормаПечатиЦенников= ПолучитьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма",, ЭтаФорма);
	ФормаЦенниковОбъект= ФормаПечатиЦенников.Объект;
	
	ЗаполнитьЗначенияСвойств(ФормаЦенниковОбъект, Объект,"Организация,Подразделение,Склад");
	
	ЗаполнитьТовары(ФормаЦенниковОбъект);
	
	КопироватьДанныеФормы(ФормаЦенниковОбъект, ФормаПечатиЦенников.Объект);
	
	ФормаПечатиЦенников.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенников(Команда)
	
	Если ЭтотОбъект.Модифицированность Или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьПечатьЦенниковЗавершение", ЭтотОбъект), НСтр("ru = 'Перед печатью ценников документ будет записан. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ОткрытьПечатьЦенников();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПечатьЦенниковЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ЭтотОбъект.Записать();
    Иначе
        Возврат;
    КонецЕсли;
    
    ОткрытьПечатьЦенников();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары(ФормаЦенниковОбъект)
	ФормаЦенниковОбъект.ВидЦены= Объект.Подразделение.ЦенаБезКарты;
	ФормаЦенниковОбъект.ВидЦеныДополнительно= Объект.Подразделение.ЦенаПоКарте;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроверкаЦенниковТовары.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследнихБезКарты.Цена КАК ЦенаБезКарты,
		|	ЦеныНоменклатурыСрезПоследнихПоКарте.Цена КАК ЦенаПоКарте,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаПоследнегоИзмененияЦены,
		|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод
		|ИЗ
		|	Документ.ПроверкаЦенников.Товары КАК ПроверкаЦенниковТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦеныБезКарты) КАК ЦеныНоменклатурыСрезПоследнихБезКарты
		|		ПО ПроверкаЦенниковТовары.Номенклатура = ЦеныНоменклатурыСрезПоследнихБезКарты.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦеныПоКарте) КАК ЦеныНоменклатурыСрезПоследнихПоКарте
		|		ПО ПроверкаЦенниковТовары.Номенклатура = ЦеныНоменклатурыСрезПоследнихПоКарте.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ПроверкаЦенниковТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КОНЕЦПЕРИОДА(&ТекДата, ДЕНЬ), ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ПроверкаЦенниковТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И (ЦеныНоменклатурыСрезПоследних.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|ГДЕ
		|	ПроверкаЦенниковТовары.ЕстьРасхождения
		|	И ПроверкаЦенниковТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроверкаЦенниковТовары.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследнихБезКарты.Цена,
		|	ЦеныНоменклатурыСрезПоследнихПоКарте.Цена,
		|	ЦеныНоменклатурыСрезПоследних.Период";
	
	Запрос.УстановитьПараметр("ВидЦеныБезКарты", Объект.Подразделение.ЦенаБезКарты);
	Запрос.УстановитьПараметр("ВидЦеныПоКарте", Объект.Подразделение.ЦенаПоКарте);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидЦены", Объект.ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока= ФормаЦенниковОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура= Выборка.Номенклатура;
		НоваяСтрока.Упаковка= Выборка.Номенклатура.ЕдиницаИзмерения;
		НоваяСтрока.Цена= Выборка.ЦенаБезКарты;
		НоваяСтрока.ЦенаДополнительно= Выборка.ЦенаПоКарте;
		НоваяСтрока.ДатаПоследнегоИзмененияЦены= Выборка.ДатаПоследнегоИзмененияЦены;
		НоваяСтрока.Штрихкод= Выборка.Штрихкод;
		НоваяСтрока.КоличествоЦенников= 1;
		НоваяСтрока.КоличествоЭтикеток= 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНетЦенникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные.НетЦенника Тогда
		ТекущиеДанные.ЕстьРасхождения = ТекущиеДанные.НетЦенника;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	//Если Не СкладПомещениеЗаполнены() Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если Объект.Товары.Количество() > 0 Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), НСтр("ru = 'Перед заполнением список товаров будет очищен. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	Если Объект.ВидПроверки=предопределенноезначение("Перечисление.ВидПроверкиЦенников.ПоПлану") Тогда
		ЗаполнитьСервер();
	Иначе
		ЗаполнитьПоПереоценке();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Объект.Товары.Очистить();
    Иначе
        Возврат;
    КонецЕсли;
    
    Если ВидПроверкиПоПлану() Тогда
		ЗаполнитьСервер();
	Иначе
		ЗаполнитьПоПереоценке();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТоварыПередОкончаниемРедактированияНаСервере(ВидЦены, ДополнительноеСведениеКолонки, Номенклатура, ЦенаТекущая, ДополнительноеСведение)
	Запрос = Новый Запрос;
	Запрос.Текст =			
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаТекущая,
		|	ДополнительныеСведения.Значение КАК ДополнительноеСведение		
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура.Ссылка = ДополнительныеСведения.Объект 
		|        	И ДополнительныеСведения.Свойство = &Свойство
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
		
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Свойство", ДополнительноеСведениеКолонки);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда	
		ЦенаТекущая = Выборка.ЦенаТекущая;	
		ДополнительноеСведение = Выборка.ДополнительноеСведение;	
	Иначе
		ЦенаТекущая = 0;	
		ДополнительноеСведение = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();	
	КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Перем ЦенаТекущая, ДополнительноеСведение;
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) Тогда
		ТоварыПередОкончаниемРедактированияНаСервере(Объект.ВидЦены, Объект.ДополнительноеСведениеКолонки, Элемент.ТекущиеДанные.Номенклатура, ЦенаТекущая, ДополнительноеСведение);
		
		Элемент.ТекущиеДанные.ЦенаТекущая = ЦенаТекущая;
		Элемент.ТекущиеДанные.ДополнительноеСведение = ДополнительноеСведение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не МожноЗаписатьДокумент Тогда
		
		Для Каждого Строка Из Объект.Товары Цикл
			Если Не Строка.Проверено И Не Строка.ЕстьРасхождения Тогда
				Отказ = Истина;
				ПоказатьВопрос(Новый ОписаниеОповещения("ПроставитьРасхожденияЗавершение", ЭтотОбъект), НСтр("ru = 'Проставить расхождения у непроверенных позиций?'"), РежимДиалогаВопрос.ДаНетОтмена);
				Возврат;	
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		МожноЗаписатьДокумент = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроставитьРасхожденияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Для Каждого Строка Из Объект.Товары Цикл
			Если Не Строка.Проверено И Не Строка.ЕстьРасхождения Тогда
				Строка.ЕстьРасхождения = Истина;
			КонецЕсли;
		КонецЦикла;
		
		МожноЗаписатьДокумент = Истина;
        ЭтотОбъект.Записать();
		
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		МожноЗаписатьДокумент = Истина;
		ЭтотОбъект.Записать();
    КонецЕсли;
    

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоДопСведению()	
	Если ЗначениеЗаполнено(Объект.ДополнительноеСведениеКолонки) Тогда 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
						|	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
						|ИЗ
						|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
						|ГДЕ
						|	ЗначенияСвойствОбъектов.Владелец = &Владелец"; 
		
		Запрос.УстановитьПараметр("Владелец", Объект.ДополнительноеСведениеКолонки);  
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0); 
		Если ЗначениеЗаполнено(РезультатЗапроса) Тогда  
			ЗначенияДополнительногоСведения.ЗагрузитьЗначения(РезультатЗапроса);       
			Элементы.ЗначенияДополнительногоСведения.ВыбиратьТип = Ложь; 
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	
	ЗначенияДополнительногоСведения.Очистить();
	Элементы.ЗначенияДополнительногоСведения.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеСведениеКолонкиПриИзменении(Элемент) 
	ЗаполнитьЗначенияПоДопСведению(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияДополнительногоСведенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	Если Не Элементы.ЗначенияДополнительногоСведения.ВыбиратьТип Тогда
		СтандартнаяОбработка = Ложь;   
			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Объект.ДополнительноеСведениеКолонки));
		ПараметрыФормы.Вставить("ВыделитьСтрокиМассив", ЗначенияДополнительногоСведения.ВыгрузитьЗначения());

		ОткрытьФорму(
			"Справочник.ЗначенияСвойствОбъектов.Форма.ФормаСписка", 
			ПараметрыФормы, 
			ЭтаФорма,
			,
			,
			, 
			Новый ОписаниеОповещения("ВыбратьРезультат", ЭтаФорма), 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	КонецЕсли;
КонецПроцедуры
                                 
&НаКлиенте 
Процедура ВыбратьРезультат(МассивРезультатов, ДополнительныеПараметры) Экспорт  
	Если ЗначениеЗаполнено(МассивРезультатов) Тогда  
		ЗначенияДополнительногоСведения.ЗагрузитьЗначения(МассивРезультатов);
	КонецЕсли;
КонецПроцедуры

Функция ПараметрыЗагрузкиНоменклатуры() Экспорт
	
	ПараметрыЗагрузкиНоменклатуры = Новый Структура();
	ПараметрыЗагрузкиНоменклатуры.Вставить("Заголовок", НСтр("ru = 'Загрузка товаров из внешних файлов'"));
	ПараметрыЗагрузкиНоменклатуры.Вставить("ДополнительноеСведение", ""); 
	ПараметрыЗагрузкиНоменклатуры.Вставить("ДатаДокумента", '00010101');
	ПараметрыЗагрузкиНоменклатуры.Вставить("ВидЦены", "");
	
	ПараметрыЗагрузкиНоменклатуры.Вставить("ПараметрыОтбора", Новый Структура);
	
	Возврат ПараметрыЗагрузкиНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыЗагрузки = ПараметрыЗагрузкиНоменклатуры();
	ПараметрыЗагрузки.ВидЦены = Объект.ВидЦены;               
	ПараметрыЗагрузки.ДатаДокумента = Объект.Дата;
	ПараметрыЗагрузки.ДополнительноеСведение = Объект.ДополнительноеСведениеКолонки;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзВнешнегоФайлаЗавершение", ЭтотОбъект);  	
	ОткрытьФорму("Обработка.ЗагрузкаТоваровИзВнешнихФайлов.Форма.ФормаПроверкиЦенников", ПараметрыЗагрузки,
		Оповещение.Модуль, , , , Оповещение);                                     	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	Объект.Товары.Очистить();	
	
	Если ЗначениеЗаполнено(АдресЗагруженныхДанных) Тогда
		ПолучитьЗагруженныеТоварыИзХранилища(АдресЗагруженныхДанных);
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	//СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	//СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	//СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	//СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	//СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	//СтруктураДействий.Вставить("ЗаполнитьПодразделениеВСтрокеТЧ", Новый Структура("Подразделение", Объект.Подразделение));
	//ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);
	//
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	//
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		СтрокаТЧТовары = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ВидПроверкиПоПлану()
	Возврат Объект.ВидПроверки = Перечисления.ВидПроверкиЦенников.ПоПлану;
КонецФункции 

&НаСервере
Функция ВидПроверкиПоПереоценке()
	Возврат Объект.ВидПроверки = Перечисления.ВидПроверкиЦенников.ПоПереоценке;
КонецФункции 

&НаСервере
Процедура ЗаполнитьПоПереоценке()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СобытияПечатиЦенниковСрезПоследних.Номенклатура КАК Номенклатура,
		|	СобытияПечатиЦенниковСрезПоследних.Номенклатура.Код КАК Код,
		|	СобытияПечатиЦенниковСрезПоследних.Цена КАК ЦенаТекущая
		|ИЗ
		|	РегистрСведений.СобытияПечатиЦенников.СрезПоследних КАК СобытияПечатиЦенниковСрезПоследних
		|ГДЕ
		|	СобытияПечатиЦенниковСрезПоследних.ВидЦены = &ВидЦены
		|	И СобытияПечатиЦенниковСрезПоследних.Подразделение = &Подразделение
		|	И СобытияПечатиЦенниковСрезПоследних.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ (СобытияПечатиЦенниковСрезПоследних.Период, СобытияПечатиЦенниковСрезПоследних.Номенклатура, СобытияПечатиЦенниковСрезПоследних.Цена) В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					СобытияПечатиЦенниковСрезПоследних.Период КАК Период,
		|					СобытияПечатиЦенниковСрезПоследних.Номенклатура КАК Номенклатура,
		|					СобытияПечатиЦенниковСрезПоследних.Цена КАК Цена
		|				ИЗ
		|					РегистрСведений.СобытияПечатиЦенников.СрезПоследних КАК СобытияПечатиЦенниковСрезПоследних
		|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроверкаЦенников.Товары КАК ПроверкаЦенников
		|						ПО
		|							ПроверкаЦенников.Ссылка.Подразделение = СобытияПечатиЦенниковСрезПоследних.Подразделение
		|								И ПроверкаЦенников.Ссылка.ВидЦены = СобытияПечатиЦенниковСрезПоследних.ВидЦены
		|								И ПроверкаЦенников.Номенклатура = СобытияПечатиЦенниковСрезПоследних.Номенклатура
		|								И Не ПроверкаЦенников.ЕстьРасхождения
		|				ГДЕ
		|					СобытияПечатиЦенниковСрезПоследних.ВидЦены = &ВидЦены
		|					И СобытияПечатиЦенниковСрезПоследних.Подразделение = &Подразделение
		|					И СобытияПечатиЦенниковСрезПоследних.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|					И ПроверкаЦенников.Ссылка.Дата >= СобытияПечатиЦенниковСрезПоследних.Период
		|					И ПроверкаЦенников.Ссылка.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ВидПроверкиЦенников.ПоПереоценке))";
	
	Запрос.УстановитьПараметр("ВидЦены", Объект.ВидЦены);
	Запрос.УстановитьПараметр("ДатаНачала", ПериодПечатиЦен.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодПечатиЦен.ДатаОкончания);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();

	Объект.Товары.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры 


&НаКлиенте
Процедура ВидПроверкиПриИзменении(Элемент)
	Если ВидПроверкиПоПлану() Тогда
		Элементы.ТоварыНетЦенника.Заголовок = "Нет ценника";
	Иначе
		Элементы.ТоварыНетЦенника.Заголовок = "Нет актуального ценника";
	КонецЕсли;
КонецПроцедуры
